import time
import os

# ANSI-коды цветов радуги
colors = [
    "\033[91m",  # Красный
    "\033[93m",  # Жёлтый
    "\033[92m",  # Зелёный
    "\033[96m",  # Голубой
    "\033[94m",  # Синий
    "\033[95m"   # Фиолетовый
]

heart = [
    "       **     **       ",
    "     ****** ******     ",
    "   *****************   ",
    "  *******************  ",
    " ********************* ",
    " ********************* ",
    "  *******************  ",
    "   *****************   ",
    "    ***************    ",
    "      ***********      ",
    "        *******        ",
    "          ***          ",
    "           *           "
]

# Очистка экрана
def clear_screen():
    os.system("cls" if os.name == "nt" else "clear")


# Радужная анимация
while True:
    for color in colors:
        clear_screen()

        print("\n")

        for line in heart:
            print(color + line)

        # Возвращаем стандартный цвет
        print("\033[0m")

        time.sleep(0.15)